IDEA Open Model
Vector3D Class
Compatible with IDEA StatiCa Beta 20.0
 Represents a vector in three-dimensional space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Geometry3D.Vector3D
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class Vector3D : OpenObject
Public Class Vector3D
	Inherits OpenObject
The Vector3D type exposes the following members.
Constructors
Name | Description
Vector3D
Initializes a new instance of the Vector3D class
Top
Properties
Name | Description
X
 Gets or sets the X-dirrection value
Y
 Gets or sets the Y-dirrection value
Z
 Gets or sets the Z-dirrection value
Top
See Also
Reference
IdeaRS.OpenModel.Geometry3D Namespace